0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    body
    {
        type            zeroGradient;
    }


    inlet1
    {
        type            fixedValue;
        value           uniform 273;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 350;
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
}


// ************************************************************************* //
// *********************	tensor-vlv-2024		******************** //
// *********************	pttensor.com		******************** //

