0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    body
    {
        type            noSlip;
    }
    inlet1
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.001;  // Specify the mass flow rate (in kg/s)
        rho             rho;           
        value           uniform (0 0 0);  // Placeholder, calculated by OpenFOAM
    }
    inlet2
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.001;
        rho             rho;           
        value           uniform (0 0 0);  // Placeholder, calculated by OpenFOAM
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
// *********************	tensor-vlv-2024		******************** //
// *********************	pttensor.com		******************** //