0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    body
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    inlet1
    {
        type            fixedValue;
        value           uniform 0.1;
    }

    inlet2
    {
        type            fixedValue;
        value           uniform 0.1;
    }

    outlet1
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
// *********************	tensor-inf-2024		******************** //
// *********************	pttensor.com		******************** //
