constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    body
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4632;
        startFace       34287;
    }
    inlet1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          42;
        startFace       38919;
    }
    inlet2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          36;
        startFace       38961;
    }
    outlet1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          58;
        startFace       38997;
    }
)

// ************************************************************************* //
