system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (-0.11 -0.021 -0.01) //0
    (0.021 -0.021 -0.01) //1
    (0.021 0.126 -0.01) //2
    (-0.11 0.126 -0.01) //3

    (-0.11 -0.021 0.04) //0
    (0.021 -0.021 0.04) //1
    (0.021 0.126 0.04) //2
    (-0.11 0.126 0.04) //3

);


blocks
(
    hex (0 1 2 3 4 5 6 7)(48 60 12)
    simpleGrading (1 1 1)

);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (1 2 5 6)
            (0 3 7 4)
            (0 1 5 4)
            (3 2 6 7)
            (4 5 6 7)
        );
    }
    
);

// ************************************************************************* //
// *********************	tensor-inf-2024		******************** //
// *********************	pttensor.com		******************** //